Revit 2027 API
StructuralConnectionHandlerType.GetDefaultConnectionHandlerType Method
 Gets a default type id for Structural Connection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetDefaultConnectionHandlerType(
	Document pADoc
)
Public Shared Function GetDefaultConnectionHandlerType (
	pADoc As Document
) As ElementId
public:
static ElementId^ GetDefaultConnectionHandlerType(
	Document^ pADoc
)
static member GetDefaultConnectionHandlerType :
        pADoc : Document -> ElementId
Parameters
pADoc Document
 The document.
Return Value
ElementId
 The type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace